---
kind: method
id: M:Autodesk.Revit.DB.View.IsViewValidForTemplateCreation
zh: 视图
source: html/8de8549b-ded8-94e1-434f-4883afc77028.htm
---
# Autodesk.Revit.DB.View.IsViewValidForTemplateCreation Method

**中文**: 视图

Verifies that the view is valid for template creation.

## Syntax (C#)
```csharp
public bool IsViewValidForTemplateCreation()
```

## Returns
True if the view can be used for view template creation, false otherwise.